cmsis-svd/cmsis-svd/data/GigaDevice/GD32E501.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CLA</name>
      <description>Configurable Logic Array unit</description>
      <groupName>CLA</groupName>
      <baseAddress>0x40038000</baseAddress>
         <addressBlock>
         <offset>0x0</offset>
          <size>0x400</size>
          <usage>registers</usage>
          </addressBlock>
          <registers>
             <register>
          <name>GCTL</name>
          <displayName>GCTL</displayName>
          <description>Global control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLA0EN</name>
              <description>CLA0 uint enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>CLA1EN</name>
              <description>CLA1 uint enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA2EN</name>
              <description>CLA2 uint enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA3EN</name>
              <description>CLA3 uint enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA4EN</name>
              <description>CLA4 uint enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA5EN</name>
              <description>CLA5 uint enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA6EN</name>
              <description>CLA6 uint enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA7EN</name>
              <description>CLA7 uint enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTE</name>
          <displayName>INTE</displayName>
          <description>Interrupt flag enable register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLA0NIE</name>
              <description>CLA0 unit negedge interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>CLA0PIE</name>
              <description>CLA0 unit posedge interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>CLA1NIE</name>
              <description>CLA1 unit negedge interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>CLA1PIE</name>
              <description>CLA1 unit posedge interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA2NIE</name>
              <description>CLA2 unit negedge interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>CLA2PIE</name>
              <description>CLA2 unit posedge interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA3NIE</name>
              <description>CLA3 unit negedge interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>CLA3PIE</name>
              <description>CLA3 unit posedge interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA4NIE</name>
              <description>CLA4 unit negedge interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>CLA4PIE</name>
              <description>CLA4 unit posedge interrupt enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA5NIE</name>
              <description>CLA5 unit negedge interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>CLA5PIE</name>
              <description>CLA5 unit posedge interrupt enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA6NIE</name>
              <description>CLA6 unit negedge interrupt enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>CLA6PIE</name>
              <description>CLA6 unit posedge interrupt enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA7NIE</name>
              <description>CLA7 unit negedge interrupt enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>CLA7PIE</name>
              <description>CLA7 unit posedge interrupt enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTF</name>
          <displayName>INTF</displayName>
          <description>Interrupt flag register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLA0NF</name>
              <description>CLA0 unit negegde flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA0PF</name>
              <description>CLA0 unit posegde flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA1NF</name>
              <description>CLA1 unit negegde flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA1PF</name>
              <description>CLA1 unit posegde flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>CLA2NF</name>
              <description>CLA2 unit negegde flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA2PF</name>
              <description>CLA2 unit posegde flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>CLA3NF</name>
              <description>CLA3 unit negegde flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA3PF</name>
              <description>CLA3 unit posegde flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>CLA4NF</name>
              <description>CLA4 unit negegde flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA4PF</name>
              <description>CLA4 unit posegde flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>CLA5NF</name>
              <description>CLA5 unit negegde flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA5PF</name>
              <description>CLA5 unit posegde flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>CLA6NF</name>
              <description>CLA6 unit negegde flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA6PF</name>
              <description>CLA6 unit posegde flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>CLA7NF</name>
              <description>CLA7 unit negegde flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA7PF</name>
              <description>CLA7 unit posegde flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <displayName>STAT</displayName>
          <description>Status Register</description>
          <addressOffset>0x0c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLA0OUT</name>
              <description>CLA0 unit output state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA1OUT</name>
              <description>CLA1 unit output state</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA2OUT</name>
              <description>CLA2 unit output state</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA3OUT</name>
              <description>CLA3 unit output state</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA4OUT</name>
              <description>CLA4 unit output state</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA5OUT</name>
              <description>CLA5 unit output state</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA6OUT</name>
              <description>CLA6 unit output state</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLA7OUT</name>
              <description>CLA7 unit output state</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLA0_MUXS</name>
          <displayName>CLA0_MUXS</displayName>
          <description>Multiplexer selection register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MUX1</name>
              <description>multiplexer 1 input selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MUX0</name>
              <description>multiplexer 0 input selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MUX1_MSB</name>
              <description>multiplexer 1 input selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUX0_MSB</name>
              <description>multiplexer 0 input selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLA1_MUXS</name>
          <displayName>CLA1_MUXS</displayName>
          <description>Multiplexer selection register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MUX1</name>
              <description>multiplexer 1 input selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MUX0</name>
              <description>multiplexer 0 input selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MUX1_MSB</name>
              <description>multiplexer 1 input selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUX0_MSB</name>
              <description>multiplexer 0 input selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLA2_MUXS</name>
          <displayName>CLA2_MUXS</displayName>
          <description>Multiplexer selection register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MUX1</name>
              <description>multiplexer 1 input selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MUX0</name>
              <description>multiplexer 0 input selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MUX1_MSB</name>
              <description>multiplexer 1 input selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUX0_MSB</name>
              <description>multiplexer 0 input selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLA3_MUXS</name>
          <displayName>CLA3_MUXS</displayName>
          <description>Multiplexer selection register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MUX1</name>
              <description>multiplexer 1 input selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MUX0</name>
              <description>multiplexer 0 input selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MUX1_MSB</name>
              <description>multiplexer 1 input selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUX0_MSB</name>
              <description>multiplexer 0 input selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLA4_MUXS</name>
          <displayName>CLA4_MUXS</displayName>
          <description>Multiplexer selection register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MUX1</name>
              <description>multiplexer 1 input selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MUX0</name>
              <description>multiplexer 0 input selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MUX1_MSB</name>
              <description>multiplexer 1 input selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUX0_MSB</name>
              <description>multiplexer 0 input selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLA5_MUXS</name>
          <displayName>CLA5_MUXS</displayName>
          <description>Multiplexer selection register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MUX1</name>
              <description>multiplexer 1 input selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MUX0</name>
              <description>multiplexer 0 input selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MUX1_MSB</name>
              <description>multiplexer 1 input selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUX0_MSB</name>
              <description>multiplexer 0 input selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLA6_MUXS</name>
          <displayName>CLA6_MUXS</displayName>
          <description>Multiplexer selection register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MUX1</name>
              <description>multiplexer 1 input selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MUX0</name>
              <description>multiplexer 0 input selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MUX1_MSB</name>
              <description>multiplexer 1 input selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUX0_MSB</name>
              <description>multiplexer 0 input selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLA7_MUXS</name>
          <displayName>CLA7_MUXS</displayName>
          <description>Multiplexer selection register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MUX1</name>
              <description>multiplexer 1 input selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MUX0</name>
              <description>multiplexer 0 input selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MUX1_MSB</name>
              <description>multiplexer 1 input selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUX0_MSB</name>
              <description>multiplexer 0 input selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLA0_LUTC</name>
          <displayName>CLA0_LUTC</displayName>
          <description>LUT control register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LUTCTL</name>
              <description>LUTCTL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
