cmsis-svd/cmsis-svd/data/GigaDevice/GD32E501.svd
        <register>
          <name>STATC</name>
          <displayName>STATC</displayName>
          <description>Status clear register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SMBALTC</name>
              <description>SMBus Alert flag clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMEOUTC</name>
              <description>TIMEOUT flag clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PECERRC</name>
              <description>PEC error flag clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUERRC</name>
              <description>Overrun/Underrun flag clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOSTARBC</name>
              <description>Arbitration Lost flag clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BERRC</name>
              <description>Bus error flag clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STPDETC</name>
              <description>STPDET flag clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NACKC</name>
              <description>Not Acknowledge flag clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADDSENDC</name>
              <description>ADDSEND flag clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PEC</name>
          <displayName>PEC</displayName>
          <description>PEC register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PECV</name>
              <description>Packet Error Checking Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDATA</name>
          <displayName>RDATA</displayName>
          <description>receive data register </description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDATA</name>
              <description>Receive data value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TDATA</name>
          <displayName>TDATA</displayName>
          <description>Transmit data register </description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TDATA</name>
              <description>Transmit data value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL2</name>
          <displayName>CTL2</displayName>
          <description>Control register 2</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000FE00</resetValue>
          <fields>
            <field>
              <name>ADDM</name>
              <description>Defines which bits of ADDRESS
               are compared with an incoming address byte</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C1</name>
      <baseAddress>0x40005800</baseAddress>
      <interrupt>
        <name>I2C1_EV</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>I2C1_ER</name>
        <value>34</value>
      </interrupt>
    </peripheral>
   <peripheral derivedFrom="I2C0">
      <name>I2C2</name>
      <baseAddress>0x4000C000</baseAddress>
      <interrupt>
        <name>I2C2_EV</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>I2C2_ER</name>
        <value>36</value>
      </interrupt>
    </peripheral>

   <peripheral>
      <name>MDIO</name>
      <description>Management data input/output</description>
      <baseAddress>0x4000D800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MDIO</name>       
        <value>40</value>
      </interrupt>
      <registers>
        <register>
          <name>CTL</name>
          <displayName>CTL</displayName>
          <description>Control register </description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields> 
            <field>
              <name>PHYB</name>
              <description>MDIO PHY bit length</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RFRM</name>
          <displayName>RFRM</displayName>
          <description>Received frame information register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RTA</name>
              <description>Received frame field TA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RDEV</name>
              <description>Received frame field DEVADD</description>
              <bitOffset>7</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
             <field>
              <name>RPHY</name>
              <description>Received frame field  PHYADR</description>
              <bitOffset>2</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
             <field>
              <name>ROP</name>
              <description>Received frame field OP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDATA</name>
          <displayName>RDATA</displayName>
          <description>Received data register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDATA</name>
              <description>Received frame field DATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RADDR</name>
          <displayName>RADDR</displayName>
          <description>Received address register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>RADDR</name>
              <description>Received frame field ADDRESS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>TDATA</name>
          <displayName>TDATA</displayName>
          <description>Transfer data register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>TDATA</name>
              <description>Transfer data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <displayName>CFG</displayName>
          <description>Configuration register </description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EDEVADD</name>
              <description>Expected DEVADD</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>EPHYSEL</name>
              <description>Selects expected PHYADR</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PHYSW</name>
              <description>Software provided PHYADR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <displayName>STAT</displayName>
          <description>Status register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RBNE</name>
              <description>Read data buffer not empty flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Receive overrun flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read</access>
            </field>
            <field>
              <name>UDR</name>
              <description>Transmit underrun flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read</access>
            </field>
             <field>
              <name>TO</name>
              <description>Timeout flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read</access>
            </field>
           <field>
              <name>TANM</name>
              <description>Set at end bit of TA of a write data frame or a write address frame</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read</access>
            </field>
             <field>
              <name>PHYNM</name>
              <description>Set at end bit of PHYADR if PHYADR nonmatches</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read</access>
            </field>
             <field>
              <name>PHYM</name>
              <description>Set at end bit of PHYADR if PHYADR matches</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read</access>
            </field>
             <field>
              <name>DEVNM</name>
              <description>Set at end bit of DEVADD if DEVADD nonmatches</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read</access>
            </field>
             <field>
              <name>DEVM</name>
              <description>Set at end bit of DEVADD if DEVADD matches</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read</access>
            </field>
            <field>
              <name>RDFRM</name>
              <description>Set at end bit of a read data frame if DEVADD and PHYADR both match</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read</access>
            </field>
             <field>
              <name>RDINCFRM</name>
              <description>Set at end bit of a post read increment address frame if DEVADD and PHYADR both match</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read</access>
            </field>
             <field>
              <name>ADDRFRM</name>
              <description>Set at end bit of a write address frame if DEVADD and PHYADR both match</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read</access>
            </field>
             <field>
              <name>WRFRM</name>
              <description>Set at end bit of a write data frame if DEVADD and PHYADR both match</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read</access>
            </field>
          </fields>
        </register>

       <register>
          <name>INTEN</name>
          <displayName>INTEN</displayName>
          <description>Interrupt enable register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RBNEIE</name>
              <description>interrupt is requested when RBDE bit in MDIO_STAT register becomes active</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRIE</name>
              <description> interrupt is requested when OVR bit in MDIO_STAT register becomes active</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UDRIE</name>
              <description> interrupt is requested when UDR bit in MDIO_STAT register becomes active</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
             <field>
              <name>TOIE</name>
              <description> interrupt is requested when TO bit in MDIO_STAT register becomes active</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
           <field>
              <name>TANMIE</name>
              <description>interrupt is requested when TANM bit in MDIO_STAT register becomes active</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
             <field>
              <name>PHYNMIE</name>
              <description>interrupt is requested when PHYNM bit in MDIO_STAT register becomes active</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
             <field>
              <name>PHYMIE</name>
              <description>interrupt is requested when PHYM bit in MDIO_STAT register becomes active</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
             <field>
              <name>DEVNMIE</name>
              <description>interrupt is requested when DEVNM bit in MDIO_STAT register becomes active</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
             <field>
              <name>DEVMIE</name>
              <description>interrupt is requested when DEVM bit in MDIO_STAT register becomes active</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDFRMIE</name>
              <description>interrupt is requested when RDFRM bit in MDIO_STAT register becomes active</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
             <field>
              <name>RDINCFRMIE</name>
              <description>interrupt is requested when RDINCFRM bit in MDIO_STAT register becomes active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
             <field>
              <name>ADDRFRMIE</name>
              <description>interrupt is requested when ADDRFRM bit in MDIO_STAT register becomes active</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
             <field>
              <name>WRFRMIE</name>
              <description>interrupt is requested when WRFRM bit in MDIO_STAT register becomes active</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN</name>
          <displayName>PIN</displayName>
          <description>pin value register </description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PHYPIN</name>
              <description>Pin value read from hardware PRTADR[4:0] pins</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>TO</name>
          <displayName>TO</displayName>
          <description>Timeout register </description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TOCNT</name>
              <description>MDIO time out</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
             <field>
              <name>TOEN</name>
              <description>Timeout enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
